---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Erase(Autodesk.Revit.DB.Electrical.DistributionSysType)
source: html/cd6b4331-a5e8-bcc2-2797-eb8473713d9b.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Erase Method

Removes a specified DistributionSys type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	DistributionSysType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.DistributionSysType`) - The DistributionSys type to be erased.

## Returns
The number of DistributionSys types that were erased from the set.